Repository: 84000/data-translation-memory
Catalog: toh64-v3.tmx
Source language: bo
Languages: en

source: གཞན་གྱིས་འགྲོན་གཉེར་ཡོང་མི་ལེན། །དེ་ཚེ་རྒྱལ་པོའི་ཕོ་བྲང་ནང་། །བཙུན་མོ་འཁོར་བཅས་བརྒྱད་ཁྲི་རྣམས། །དམ་པའི་དོན་ནི་ཐོས་པས་ན། །ཕྱིར་མི་ལྡོག་ལ་གནས་པར་གྱུར། །
en: “At that time, in the king’s palace, The eighty thousand ladies with their retinues, When they heard the highest truth, Abided in irreversibility.

source: རྒྱལ་པོས་སངས་རྒྱས་གསུངས་པ་བཞིན། །ལོ་ནི་ཉི་ཤུ་རྩ་བཞིའི་བར། །ཉིན་མཚན་རྟག་པར་སྡིག་བཤགས་ཀྱང་། །
en: “The king, in accordance with what the Buddha taught, For twenty-four years, constantly, day and night, Apologized for his bad actions.

source: འོན་ཀྱང་སྡིག་པའི་ལས་མ་ཟད། །
en: Nevertheless, his bad actions were not extinguished. “A crowd of a hundred koṭis Confronted the Dharma teacher with evil intentions. As a result of this, after death, They fell to Avīci hell.

source: ལོ་ནི་བྱེ་མང་སྡུག་བསྔལ་མྱོང་། །
en: “They suffered for many millions of years.

source: སྡིག་ཟད་དེ་བཞིན་གཤེགས་དང་ཕྲད། །
en: When their bad actions were extinguished, they met with the Tathāgata.

source: སྔོན་ནི་སྐྲག་པར་བྱས་པའི་རྒྱུས། །རྣམ་སྨིན་ལྷག་མ་རྟག་པར་དམན། །
en: But because they were afraid in the past, Their residual karmic retribution was always inferior.

source: མཐར་གྱིས་རྣལ་འབྱོར་རབ་བསྒོམས་ཏེ། །སངས་རྒྱས་བྱེ་བ་སྟོང་མཆོད་ནས། །སོ་སོར་ཞིང་ཁམས་གཞན་དག་ཏུ། །ཐམས་ཅད་མངོན་པར་རྫོགས་སངས་རྒྱས། །
en: “They practiced yoga gradually, And after they worshiped thousands of millions of buddhas, Each in a different country, They all became perfectly enlightened.

source: ཐམས་ཅད་ཀུན་ཀྱང་མཚན་འཐུན་པར། །
en: “And they all had the same name.

source: ཡོན་ཏན་གྲགས་པ་ཞེས་བྱར་གྱུར། །
en: They were called Virtuous Glory.

source: དེ་ཚེ་རྒྱལ་པོ་རྒྱ་ཆེར་བྱིན། །དགེ་སྦྱོང་བྱམས་བཟོད་དེ་ལ་ནི། །གདུག་པའི་སེམས་ནི་བསྐྱེད་པས་ན། །ལོ་ནི་བྱེ་བ་མང་པོར་ཡང་། །སྔོན་གྱི་སྡིག་ལས་མངོན་གྱུར་པས། །
en: Then King Extensively Giving, In the place where the compassionate and tolerant ascetic was, “Because he produced a poisonous thought, And since, for many millions of years, His former bad actions were manifest, He fell to Loud Howling hell.

source: ངུ་འབོད་ཆེན་པོར་ལྷུང་བར་གྱུར། །རྣམ་སྨིན་དེ་ནི་ཟད་ནས་ཀྱང་། །སླར་ཡང་མི་ལུས་ཐོབ་གྱུར་ཏེ། །
en: “And when that karmic result was extinguished, He again obtained a human body.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་སྤྱན་ཕྲད། །རྟག་ཏུ་བསྙེན་བཀུར་རིམ་གྲོ་བྱས། །
en: He met the Tathāgata All-Seeing And always respected and worshiped him.

source: གཞན་ཡང་སངས་རྒྱས་བྱེ་བ་ཕྲག །བརྒྱད་ཅུ་དག་ལ་རིམ་གྲོ་བྱས། །
en: “Furthermore, he served Eighty million buddhas.

source: དེ་ཡི་འོག་ཏུ་སངས་རྒྱས་པ། །དེ་ནི་ང་བདག་ཉིད་ཡིན་ནོ། །
en: The one enlightened after that Is I.

source: ཆོས་སྨྲ་ཉེས་པ་མེད་པ་ལ། །གནོད་པ་བྱས་པའི་དགེ་སློང་ནི། །མ་འོངས་མངོན་པར་འཚང་རྒྱ་བ། །བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཡིན། །
en: “The monk who wished to harm The innocent Dharma teacher In the future will be the Truly enlightened bodhisattva, Maitreya.

source: དེ་ཚེ་རྒྱལ་པོ་ཕོ་བྲང་ནང་། །བཙུན་མོའི་འཁོར་ནི་བརྒྱད་ཁྲི་རྣམས། །ཤིན་ཏུ་དང་བས་དགེ་རྩ་བསྐྱེད། །སངས་རྒྱས་ཚད་མེད་རིམ་གྲོ་བྱས། །
en: “The eighty thousand retinues of ladies In the king’s palace at that time Produced roots of good because they were very pure And worshiped innumerable buddhas.

source: དེ་ལྟར་སྤྱོད་པ་རབ་བསྐྱེད་ནས། །སེམས་ཅན་ཕན་གདགས་སྨོན་ལམ་བཏབ། །སངས་རྒྱས་བྱེ་བ་སྟོང་མཆོད་ནས། །སོ་སོར་མངོན་པར་འཚང་རྒྱ་ཡང་། །
en: “Since they did such deeds, And vowed to benefit sentient beings, After they venerate millions of buddhas, They each will become enlightened.

source: ངས་དེང་ཁྱོད་ལ་བསྒོ་བ་ནི། །ཐམས་ཅད་གནོད་སེམས་མ་སྐྱེད་ཅིག །
en: “I now instruct you: Do not produce any harmful thoughts.

source: གང་ཞིག་བྱམས་བསྒོམས་སངས་རྒྱས་བསྔགས། །མྱུར་དུ་བྱང་ཆུབ་ཆེན་པོ་འཐོབ། །
en: Whoever practices kindness and praises the Buddha Will quickly obtain great enlightenment.

source: དེ་ལྟ་བས་ན་གློག་ཐོབ་སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་དང་། རང་བཞིན་དང་། བསམ་པ་དག་ལ་མི་མཁས་བ་དག་གིས་དུས་ཐམས་ཅད་དུ་གནོད་སེམས་བསྐྱེད་པར་མི་བྱའོ། །
en: “Therefore, Vidyutprāpta, those who do not understand well the faculties, nature, and aspirations of sentient beings should not produce harmful thoughts.

source: གློག་ཐོབ་འདི་ལྟ་སྟེ་དཔེར་ན་རི་རྣམས་ཀྱི་ནང་ན་རི་རབ་མཆོག་ཏུ་གྱུར་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱང་ཡེ་ཤེས་རྣམས་ཀྱི་ནང་ན་མཆོག་དང་གཙོ་བོ་དང་། བླ་ན་མེད་པར་གྱུར་པ་ཡིན་ནོ། །
en: Vidyutprāpta, to give an analogy, just as Sumeru is the greatest among mountains, similarly, the wisdom of the Tathāgata is the greatest and most excellent and unsurpassable of wisdoms.

source: འདི་ལྟ་སྟེ་དཔེར་ན་ཆུ་བོ་ཐམས་ཅད་ཀྱི་ནང་ན་རྒྱ་མཚོ་མཆོག་ཏུ་གྱུར་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱང་ཡེ་ཤེས་རྣམས་ཀྱི་ནང་ན་མཆོག་ཏུ་ཟབ་ཅིང་རྒྱ་ཆེ་བར་གྱུར་པ་ཡིན་ནོ། །གཞན་ཡང་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱལ་པོ་རྣམས་ཀྱི་ནང་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མཆོག་དང་། གཙོ་བོ་དང་།
en: To give another analogy, just as the ocean is the greatest among all waters, similarly, the wisdom of the Tathāgata is the most excellent and deepest and broadest of all wisdoms.

source: བླ་མར་གྱུར་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱང་ཡེ་ཤེས་རྣམས་ཀྱི་ནང་ན་གོང་ན་མེད་པར་གྱུར་པ་ཡིན་ནོ། །
en: To give another analogy, just as the cakravartin is the greatest and most excellent and unsurpassable, the wisdom of the Tathāgata is unsurpassed among wisdoms.

source: གློག་ཐོབ་དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟ་བུའི་མཁྱེན་པ་དང་ལྡན་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་།
en: “Vidyutprāpta, the Tathāgata, due to his being endowed with this sort of knowledge, knows the minds and all the changes in the operation of mental factors of those with lustful, angry, or deluded temperaments and helps them all in a snap of the fingers.

source: གཏི་མུག་སྤྱོད་པའི་སེམས་དང་སེམས་ལས་བྱུང་བ་འཇུག་ཅིང་འགྱུར་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཅིང་སེ་གོལ་གཏོགས་པ་གཅིག་ལ་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པར་མཛད་དོ། །
en: “Vidyutprāpta, the Tathāgata is endowed with omniscience.

source: གློག་ཐོབ་དེ་བཞིན་གཤེགས་པ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པས་འདི་ལྟ་སྟེ་དཔེར་ན་སྐྱེས་བུ་མིག་དང་ལྡན་པས་རྩོལ་བ་ལ་མི་ལྟོས་པར་རང་གི་ལག་མཐིལ་ན་སྐྱུ་རུ་རའི་འབྲས་བུ་གསལ་བར་མཐོང་ཞིང་ཐེ་ཚོམ་མེད་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཅན་གྱི་སྤྱོད་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་པས་འཁོར་མང་པོའི་ནང་དུ་ཆོས་རྣམ་པ་སྣ་ཚོགས་ཡང་དག་པར་སྟོན་པར་མཛད་དོ། །
en: To give an analogy, a clear-sighted person, seeing clearly without effort a myrobalan fruit in the palm of his hand, has no doubt what it is. In the same way, the Tathāgata knows the mental actions of all sentient beings and correctly explains various teachings in the midst of a great assembly.

source: སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ན་འདོད་ཆགས་ཀྱི་སྤྱོད་པ་དང་མཚུངས་པར་ལྡན་པའི་སེམས་ཅན་རྣམས་འདོད་ཆགས་ཀྱིས་ཡོངས་སུ་གདུངས་ནས་ཉིན་མཚན་དུ་ཡིད་ལ་བྱེད་ཅིང་དོན་མེད་པར་དུས་ལས་འདའ་བར་བྱེད་པ་ཡང་ངས་རབ་ཏུ་མཁྱེན་ཅིང་གཟིགས་སོ། །
en: “I understand and see, in the limitless, countless buddha field world systems, sentient beings associated with the lustful temperament who are completely tormented by lust and, fixing their minds on desires night and day, pass their time meaninglessly.

source: འདོད་ཆགས་ཀྱིས་གདུང་བས། ལུས་དང་། ངག་གི་ལས་རྣམ་པ་སྣ་ཚོགས་སློང་བར་བྱེད་པ་དག་ཀྱང་ངས་རབ་ཏུ་མཁྱེན་ཅིང་གཟིགས་སོ། །
en: I know and see the various actions of body, speech, and mind that are generated due to torment by lust.

source: ཞེ་སྡང་སྤྱོད་པའི་སེམས་ཅན་དེ་དག་ཞེ་སྡང་གི་ཟིལ་གྱིས་ནོན་ནས་གཅིག་ལ་གཅིག་ཞེ་སྡང་གིས་ཕྲག་དོག་བྱེད་པ་དང་། གནོད་པ་བྱས་པའི་ཕྱིར་མནར་མེད་པའི་གནས་སུ་ལྟུང་བར་འགྱུར་བ་དག་ཀྱང་ངས་རབ་ཏུ་མཁྱེན་ཅིང་གཟིགས་སོ། །
en: “I understand and see those sentient beings with angry temperaments who are overwhelmed by anger, and, because they are jealous of and harm one another due to anger, fall into Avīci hell.

source: གཏི་མུག་སྤྱོད་པ་དང་མཚུངས་པར་ལྡན་པའི་སེམས་ཅན་རྣམས་མ་རིག་པའི་མུན་ནག་གིས་བསྒྲིབས་ཤིང་རྨོངས་པས་མངོན་པར་ཞེན་པ་དང་། ལོག་པར་ལྟ་བའི་རྗེས་སུ་འབྲང་བ་ལ་མོས་པར་འགྱུར་བ་དག་ཀྱང་ངས་རབ་ཏུ་མཁྱེན་ཏོ། །འོས་སུ་འགྱུར་བ་དང་། འོས་སུ་མི་འགྱུར་བ་དང་།
en: “I understand sentient beings who are associated with the deluded temperament who, since they are stupefied by the darkness of ignorance, are attached to confusion and desire to follow false views.

source: འཕེལ་ཞིང་རྩོལ་བ་དང་བཅས་པ་དང་། ལྡོག་ཅིང་ཉམས་པར་གྱུར་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཐེག་པར་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པར་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དག་ཀྱང་ངས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “I understand capable ones, incapable ones, ones with increasing effort, ones who regress and fail, ones who produce roots of good in the vehicle of the tathāgata, ones who produce roots of good in the vehicle of the pratyekabuddha, and ones who produce roots of good in the vehicle of the śrāvaka.

source: དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟ་བུའི་མཁྱེན་པ་དང་ལྡན་པས་འཁོར་མང་པོའི་ནང་དུ་བཞུགས་ནས་སེམས་ཅན་གྱི་སེམས་ཀྱི་སྤྱོད་པའི་བྱེ་བྲག་ཀྱང་རབ་ཏུ་མཁྱེན་པས་གལ་ཏེ་དུས་ལ་མ་བབ་པར་རིག་པར་གྱུར་ན་ནི་ཅང་མི་གསུང་ཞིང་བཏང་སྙོམས་སུ་བཞག་ནས་སེམས་ཅན་འདི་དག་ནི་ཆོས་ལ་རྨོངས་པར་གྱུར་པས།
en: “Since the Tathāgata has this sort of wisdom, he understands the variety of temperaments of sentient beings living in his great retinue.

source: ཁོང་དུ་ཆུད་པར་མི་འགྱུར་རོ་སྙམ་དུ་དགོངས་སོ། །
en: If he knows that the time is not ripe, he does not teach anything, and, staying even-minded, he reflects on the fact that these sentient beings are confused about the Dharma and will not understand.

source: དེ་བཞིན་གཤེགས་པ་ནི་དབང་པོ་དང་སྟོབས་ཁྱད་པར་དུ་འཕགས་པ་ཕུན་སུམ་ཚོགས་ཤིང་དུས་རབ་ཏུ་མཁྱེན་པའི་ཕྱིར་གདུལ་བའི་འོས་སུ་གྱུར་པ་དང་། བསམ་པ་མཆོག་ཏུ་གྱུར་པ་དང་། བཟོད་པར་ནུས་པའི་འོས་སུ་གྱུར་པ་དང་། ཚིག་ལེགས་པར་ཉན་པར་གྱུར་པ་དག་ཀྱང་ངས་རབ་ཏུ་མཁྱེན་ཏེ།
en: “As for the Tathāgata, I am endowed with especially superior faculties and power, and because I know the moment, I know who is suitable for discipline, who is the most resolute, who is able to be patient, and who can listen well to my words.

source: དེ་ལྟར་མཁྱེན་པར་གྱུར་ནས་ཀྱང་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྡུད་ཅིང་ཕན་འདོགས་པར་བྱེད་དོ། །
en: Once I know this, I help and benefit those sentient beings.

source: དེ་ལྟ་བས་ན་གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པ་ཡང་དག་པའི་གནས་སྐབས་སུ་མ་ཞུགས་པ་སེམས་ཅན་རྣམས་ཀྱི་ལྷག་པའི་བསམ་པ་ལེགས་པར་ཁོང་དུ་མ་ཆུད་པ་དག་གིས་ཁྱིམ་ན་གནས་པ་འམ། རབ་ཏུ་བྱུང་བ་ཡང་རུང་སྟེ། ཐམས་ཅད་ཀུན་ལ་སྨོད་ཅིང་གནོད་སེམས་བསྐྱེད་ནས་ཡུན་རིང་པོར་བདག་ཉིད་ལ་གནོད་པར་འགྱུར་བ་མི་བྱའོ། །
en: “Therefore, Vidyutprāpta, beginner bodhisattvas who have not entered the state of certainty and do not know the special intentions of sentient beings, whether householders or monks, should not blame or produce malice toward anyone or do harm to themselves for a long time.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཐེག་པ་ཆེན་པོ་ལ་གནས་པ་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: From the time that the bodhisattvas first produce the thought of enlightenment, they should produce the notion of the Buddha in connection with all those who are established in the Mahāyāna.

source: སེམས་ཅན་གཞན་དག་སྡིག་པ་མི་དགེ་བའི་ལས་བྱེད་པ་མཐོང་ན་ཡང་གནོད་སེམས་བསྐྱེད་པར་མི་བྱའོ། །
en: Even if they see other beings performing sinful, unvirtuous actions, they should not produce a malicious thought.

source: དེ་བཞིན་གཤེགས་པས་རྟག་ཏུ་སེམས་ཅན་གང་རྣམ་པར་དཀར་ཞིང་ཡོངས་སུ་དག་པའི་ཆོས་ལས་ཅུང་ཟད་ཅིག་ཉན་པར་གྱུར་ན་ནམ་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བར་མི་འགྱུར་རོ་ཞེས་གསུངས་པས་སོ། །
en: The Tathāgata always says that any sentient being, if they harm even a little of the virtuous, totally pure teaching, is called one who will never enter nirvāṇa.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་གལ་ཏེ་འདོད་ཆགས་སྤྱོད་པའི་སེམས་ཅན་མཐོང་བར་གྱུར་ན་སེམས་ཅན་འདི་དག་འདོད་ཆགས་ཀྱིས་གདུང་བས་བསྲེགས་པར་གྱུར་པ་ཡང་བདག་གིས་ཉེས་པ་ཡིན་ནོ་སྙམ་དུ་སེམས་སོ། །
en: “If bodhisattvas see a sentient being whose temperament is lustful, they think, ‘These sentient beings are burned by torment due to desire, but this is my fault.’

source: ཞེ་སྡང་དང་། གཏི་མུག་གིས་གདུང་བས་བསྲེགས་པར་གྱུར་པ་དེ་དག་མཐོང་ན་ཡང་འདི་དག་ཐམས་ཅད་ནི་བདག་གིས་ཉེས་པ་ཡིན་ནོ་སྙམ་དུ་སེམས་སོ། །
en: And if they see those who are burned by torment due to anger and confusion, they think, ‘This is all my fault.’

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ན་བའི་སྡུག་བསྔལ་དང་ལྡན་པར་གྱུར་པ་དག་མཐོང་བར་གྱུར་ན་སྨན་ཡོངས་སུ་བཙལ་ཏེ་ཐབས་མཁས་པས་ཡོངས་སུ་གསོ་བའི་རིགས་པ་ལས།
en: ‘If I see all sentient beings having the suffering of illness, it is proper to find medicine and heal them with my skillful means.

source: བདག་སྔོན་སེམས་ཅན་གྱི་ནད་བསལ་བར་ཡི་དམ་བཅས་ནས་དེང་ཡལ་བར་བོར་བ་འདི་ཉིད་བདག་གི་ཉེས་པ་ཡིན་ནོ་སྙམ་དུ་སེམས་པས་སོ། །
en: Since I formerly vowed to eliminate the illnesses of sentient beings and now abandon them, this is my fault.’

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་ལྟ་བུའི་བསམ་པ་དང་ལྡན་པས་བདག་ཉིད་ཀྱི་ཉེས་པ་ལ་ལྟ་ཞིང་སེམས་ཅན་རྣམས་ལ་བྱམས་པའི་སེམས་སྐྱེད་པར་བྱེད་དོ། །
en: The bodhisattvas, since they have this kind of thought, look at their own faults and produce a thought of kindness with regard to sentient beings.

source: གལ་ཏེ་གསོད་པ་འམ། ལུས་ཀྱི་ཡན་ལག་དང་ཉིང་ལག་གཅོད་ཅིང་གཏུབ་པ་ཞིག་དང་ཕྲད་པར་གྱུར་ན་ཡང་ཕ་རོལ་གནོད་པ་བྱེད་པ་དེ་དག་ལ་ལན་བྱའོ་སྙམ་པའི་བསམ་པ་མེད་དོ། །
en: If they are killed or have their limbs and smaller body parts cut off, they do not think, ‘I should take revenge on those enemies who harm me.’

source: གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཡང་དག་པར་སྒོམ་པ་ན་འདས་པའི་མི་དགེ་བའི་ལས་ཇི་སྙེད་པ་དག་ཀྱང་གཏན་དུ་ཟད་ཅིང་མ་ལུས་པར་འབྱང་བར་འགྱུར་ལ། མ་འོངས་པའི་མི་དགེ་བ་རྣམས་ནི་ཡང་ལྡང་བར་མི་འགྱུར་རོ། །
en: “Vidyutprāpta, if the bodhisattvas practice correctly in this way, all of their past bad actions will be forever destroyed and purified without exception, and in the future bad actions will never again arise.

source: གློག་ཐོབ་སྔོན་བྱུང་བ་འདས་པའི་བསྐལ་པ་ཚད་མེད་གྲངས་མེད་པ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱི་ཡང་ཆེས་སྔ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: “Vidyutprāpta, limitless, countless kalpas in the past, much earlier than the Tathāgata Dīpaṅkara, a tathāgata, an arhat, a perfectly enlightened one, one endowed with knowledge and conduct, a sugata, a knower of the world, a supreme one, a charioteer who tames people, a teacher of gods and humans, a buddha bhagavān named Born Supreme appeared in the world.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཆོག་ཏུ་སྐྱེས་པ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་འོད་ཟེར་ཅན་ཞེས་བྱ་སྟེ། རྒྱལ་པོའི་གྲོང་ཁྱེར་རབ་ཏུ་བདེ་བ་ཞེས་བྱ་བའི་ཚལ་ན་བཞུགས་སོ། །
en: That world system was called Radiant, and he lived in a grove in the royal city, Absolute Peace.

source: དེའི་ཚེ་ཤན་པ་འཇིགས་སུ་རུང་བ་ཞེས་བྱ་བ་ཁྲོ་གཏུམ་ཆེ་ཞིང་གསོད་པ་ལ་དགའ་བ། བཟོད་པ་དང་བྱམས་པའི་སེམས་མེད་པ།
en: “At that time, there was a butcher named Dreadful, who was very vicious and enjoyed killing, who had no tolerance or kindness.

source: ལག་པ་ཁྲག་གིས་བསྐུས་པ། མཐོང་བ་ཐམས་ཅད་སྐྲག་པར་འགྱུར་བ་ཞིག་ཡོད་དེ།
en: His hands were smeared with blood, and all who saw him feared him.

source: དེའི་ཚེ་ཤན་པ་དེས་གླང་ཞིག་ཁང་པའི་ནང་དུ་བཅིངས་ཏེ་ནང་དུ་ཞུགས་ནས་གསོད་པར་བྱས་པ་ལས་གླང་དེས་དེ་མཐོང་ནས་ཤིན་ཏུ་སྐྲག་པས་ཐག་པ་བཅད་དེ་བྲོས་ནས་དེ་བཞིན་གཤེགས་པ་མཆོག་ཏུ་སྐྱེས་པ་བཞུགས་པའི་ཚལ་ག་ལ་བ་དེར་སོང་ངོ་། །
en: Once the butcher tied up an ox in his house and wanted to kill it. But the ox saw him and, very afraid, it broke the rope and went to the grove where the Tathāgata Born Supreme was staying.

source: དེའི་ཚེ་ཤན་པ་དེ་ཡང་མཚོན་ཐོགས་ནས་ཕྱི་བཞིན་དུ་བསྙགས་པས་གླང་དེ་སྐྲག་ནས་གཡང་ས་ཟབ་མོ་ཞིག་ཏུ་ལྷུང་བས་སྲོག་ཆད་ལ་ཐུག་པ་ཙམ་དུ་ན་ཞིང་སྡུག་བསྔལ་བས་སྒྲ་ཕྱུང་ངོ་། །
en: The butcher, wielding a knife, chased after the ox. Since the ox was frightened, it fell into a deep pit, and, suffering in pain almost to the point of death, it bellowed.

source: དེའི་ཚེ་ཤན་པས་གླང་དེ་མཐོང་ནས་ཞེ་སྡང་ཆེར་སྐྱེས་ཏེ། གཡང་ས་ཟབ་མོ་དེ་ཉིད་དུ་ཞུགས་ནས་མཚོན་ཐོགས་ཏེ་བསད་པར་བྱས་པ་ལས་མཚོན་མ་བཏབ་པའི་བར་སྐབས་སུ། དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མཆོག་ཏུ་སྐྱེས་པ་ཚལ་དེར་འཁོར་མང་པོ་བརྒྱ་སྟོང་ཚད་མེད་པས་ཡོངས་སུ་བསྐོར་བ་དག་ལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་སྟེ། མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད། འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: When the butcher saw the ox, he became even more angry.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས། མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ། རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ། ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ། སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ། ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ། སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ། སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་།
en: He jumped into the pit wielding the knife and wanted to kill the ox, but before the knife struck, the Tathāgata Born Supreme, surrounded by a great retinue of limitless hundreds of thousands in that grove, analyzing in detail, taught this Dharma discourse on conditioned arising: ‘Karmic forces arise on the basis of ignorance; consciousness arises on the basis of karmic forces; name and form arise on the basis of consciousness; the six senses arise on the basis of name and form; contact arises on the basis of the six senses; feeling arises on the basis of contact; desire arise on the basis of feeling; appropriation arises on the basis of desire; karmic existence arises on the basis of appropriation; birth arises on the basis of karmic existence; old age and death, sorrow, lamentation, misery, suffering, unhappiness, and troubles arise on the basis of birth.

source: སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འབྱུང་བར་འགྱུར་ཏེ། དེ་ལྟར་ན་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འདི་དག་ཐམས་ཅད་ནི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་གོ་ཞེས་རྒྱ་ཆེར་རྣམ་པར་ཕྱེ་སྟེ་སྟོན་པར་མཛད་པས།
en: Thus, all these things arising conditionally are nothing but a great heap of suffering.

source: གློག་ཐོབ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འདི་ལ་མ་རིག་པ་ཡང་འདུ་བྱེད་ལ་མི་སེམས་མི་རྟོག་ལ། འདུ་བྱེད་ཀྱང་མ་རིག་པ་ལ་མི་སེམས་མི་རྟོག་གོ །
en: “Vidyutprāpta, he continued, ‘In this conditioned arising, ignorance does not think about or reflect upon karmic forces, and karmic forces do not think about or reflect upon ignorance.

source: དེ་བཞིན་དུ་སྐྱེ་བ་ཡང་རྒ་ཤི་ལ་མི་སེམས་མི་རྟོག་ལ།
en: Similarly, old age and death do not think about or reflect upon birth, and birth does not think about or reflect upon old age and death.

source: རྒ་ཤི་ཡང་སྐྱེ་བ་ལ་མི་སེམས་མི་རྟོག་པས་དེ་ལྟར་ན་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་དམིགས་སུ་མེད་པས་མངོན་པར་འདུ་བྱ་བ་མེད་པ།
en: Thus, all dharmas, since their nature is that they cannot be apprehended, are unproduced by intentional action.

source: དྲན་པ་མེད་པ། བདག་དང་བདག་གི་བ་མེད་པ། རང་བཞིན་གྱིས་རྣམ་པར་དག་པ། ཕན་ཚུན་གཅིག་གིས་གཅིག་མི་རིག་པ་ཡིན་ནོ། །
en: They are without consciousness, without “me” and “mine,” pure by nature, and mutually unaware of one another.

source: སོ་སོའི་སྐྱེ་བོ་རྣམས་འདི་ལྟ་བུའི་ཆོས་མ་ཐོས་པའི་ཕྱིར་གཟུགས་ནི་བདག་ཡིན་ནོ། །བདག་ནི་གཟུགས་རྣམས་དང་ལྡན་ནོ། །གཟུགས་ནི་བདག་གི་ཡིན་ནོ་ཞེས་འཛིན་པར་བྱེད་དེ།
en: Because ordinary people have not heard this kind of teaching, they insist that matter is the self, that the self has matter, that matter belongs to the self.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་བར་ལ་ཡང་དེ་བཞིན་ནོ། །
en: The same is true for feelings, concepts, conditioning forces, and consciousness.

source: བདག་དང་བདག་གིར་འཛིན་པ་ལ་མངོན་པར་ཞེན་པའི་དབང་གིས་མི་རྟག་པ་ལ་རྟག་པར་འཛིན་པར་བྱེད། སྡུག་བསྔལ་བ་ལ་བདེ་བར་འཛིན་པར་བྱེད། མི་སྡུག་པ་ལ་སྡུག་པ་ཉིད་དུ་འཛིན་པར་བྱེད། བདག་མེད་པ་ལ་བདག་ཏུ་འཛིན་ཅིང་ཕྱིན་ཅི་ལོག་བཞི་སྐྱེད་པར་བྱེད་དོ། །
en: “ ‘Due to attachment to “me” and “mine,” they give rise to four perverted views: apprehending the impermanent as permanent, suffering as pleasure, the pure as impure, and no-self as self.

source: ཕྱིན་ཅི་ལོག་ཏུ་ལྟ་བའི་ཕྱིར་མ་རིག་པས་རྨོངས་ནས་ཡང་དག་པར་ཚུལ་བཞིན་དུ་ཡིད་ལ་མི་བྱེད་ཅིང་སེམས་ཀྱི་རྗེས་སུ་མངོན་པར་ཞེན་པར་གྱུར་པས་སྲིད་པའི་སྲེད་པ་འཆིང་བ་གཅོད་པར་མི་ནུས་ཤིང་འཁོར་བའི་འཁོར་བར་རྒྱུན་མི་འཆད་པར་འཁོར་བར་འགྱུར་བ་ཡིན་ནོ། །
en: “ ‘Because of these perverted views, they are confused by ignorance. Since they do not think correctly, they become mentally attached, and, since they are unable to break the bond of desire for existence, they do not interrupt the continuity of revolving in saṃsāra, and they will circle in saṃsāra.

source: མཁས་པ་དག་ནི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཚན་ཉིད་ལ་ཤིན་ཏུ་ལེགས་པར་རྟོག་པར་བྱེད་པའི་ཕྱིར་བདག་དང་། གང་ཟག་དང་། སེམས་ཅན་ཞེས་བྱ་བ་ནས་སྲོག་ཅེས་བྱ་བའི་བར་དུ་ཅུང་ཟད་ཙམ་ཡོད་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ། སྐྱེ་བ་དང་། རྒ་བ་དང་།
en: Learned ones, because they understand very well the nature of the dharmadhātu, they do not regard anything called a “self” or a “person” or a “sentient being” or a “living creature” as actually existing in the slightest, and they say that birth, old age, illness, death, killing, or evil cannot be observed.’

source: ན་བ་དང་།
en: “Vidyutprāpta, at that time, the butcher was frightened.

source: འཆི་བ་དང་། གསོད་པ་དང་། གནོད་པ་བྱེད་པ་དག་ཀྱང་མི་དམིགས་སོ་ཞེས་གསུངས་པ་དང་། གློག་ཐོབ་དེའི་ཚེ་ཤན་པ་འཇིགས་སུ་རུངས་པས་རྒྱང་ནས་དེ་བཞིན་གཤེགས་པས་ཆོས་བཤད་པའི་སྒྲ་ཐོས་ནས་གོ་བར་གྱུར་པས་དེ་མ་ཐག་ཏུ་གསོད་པའི་སེམས་ཉེ་བར་ཞི་བར་གྱུར་ནས་མཚོན་ཆ་སྤངས་ཏེ་གཡང་ས་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་དེ་ག་ལ་བ་དེར་སོང་སྟེ།
en: When, from a distance, he heard the Tathāgata teaching the Dharma, he understood, and his thought of killing was pacified.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་གཏུགས་ནས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He set his weapon aside, came out of the pit, and went to the Bhagavān.

source: བཅོམ་ལྡན་འདས་བདག་ནི་དེང་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ལམ་བསྒྲུབ་པར་འཚལ་ལོ་ཞེས་གསོལ་པ་དང་།
en: He touched the Bhagavān’s feet with his head, bowed, sat to one side, and said to the Bhagavān, ‘Bhagavān, I now wish to become a monk following the teaching of the Tathāgata and practice the path.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་དེ་རིགས་སོ། །
en: “The Bhagavān answered, ‘That is well done.

source: དགེ་སློང་ལེགས་པར་འོངས་སམ་ཞེས་གསུངས་མ་ཐག་ཏུ་དགེ་སློང་གི་དངོས་པོར་གྱུར་ནས་རྫོགས་པར་བསྙེན་པར་གྱུར་ཏོ། །
en: Welcome, monk.’ Immediately, he was fully ordained as a monk.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་མཆོག་ཏུ་སྐྱེས་པས་དེའི་ལྷག་པའི་བསམ་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་མཐར་གྱིས་ཡོངས་སུ་སྨིན་པར་མཛད་ཅིང་།
en: “The Tathāgata Born Supreme knew in his heart the former butcher’s sincerity.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམས་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་པ་འཇིགས་སུ་རུང་བས་ཐོས་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་ནས་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་ཕྱིར་མི་ལྡོག་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: It was gradually maturing. When Dreadful heard the detailed and correct teaching of the bodhisattva’s conduct, he obtained the patient acceptance of the nonarising of dharmas, and because of the Buddha’s teaching, he obtained irreversibility.

source: གླང་དེ་ཡང་དེ་བཞིན་གཤེགས་པ་དེས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ཀྱི་ཚིག་སྟོན་པའི་གསུང་སྒྲ་ཤིན་ཏུ་གྱ་ནོམ་པ་ཐོས་ནས་སེམས་ལ་རབ་ཏུ་དགའ་བ་སྐྱེས་པས་ཤི་འཕོས་པའི་འོག་ཏུ་དགའ་ལྡན་གྱི་ལྷའི་གནས་སུ་སྐྱེས་ནས་ཐ་མར་བྱམས་པ་དང་ཕྲད་དེ་ཡང་དག་པའི་དད་པ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: “As for the ox, moreover, after it heard the sublime sound of the Tathāgata teaching the dharma-phrases of conditioned origination, an intense joy arose in its mind. After the ox died, it was born in Tuṣita heaven, and, having finally met Maitreya, it became endowed with pure faith.

source: གློག་ཐོབ་དེ་ལྟར་ན་སེམས་ཅན་རྣམས་ཀྱི་སྤྱོད་པ་ནི་ཤིན་ཏུ་ཟབ་པ་དང་། རྣམ་པར་རིག་པར་དཀའ་ཞིང་ཤེས་པར་དཀའ་བ་ཡིན་ཏེ།
en: “Vidyutprāpta, the temperaments of beings thus are very deep and difficult to know, and they are difficult to understand.

source: དེའི་ཕྱིར་གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་གཉེར་བར་འདོད་པས་སེམས་ཅན་གྱི་དབང་པོ་དང་། སྤྱོད་པ་དག་ལ་ཤིན་ཏུ་མཁས་པར་བྱས་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་དང་། ཐོགས་པ་མེད་པའི་སེམས་ལ་རབ་ཏུ་གནས་ཏེ་ཆོས་ཐམས་ཅད་ལ་རྟག་ཏུ་མངོན་པར་ཞེན་པ་མེད་པར་བྱའོ། །
en: Therefore, Vidyutprāpta, any bodhisattvas who wish to acquire thoroughly unsurpassed, true, perfect enlightenment should become very knowledgeable about the faculties and actions of sentient beings, should be well established in an impartial and unobstructed mind toward all sentient beings, and should not be attached to any dharma.

source: ཅི་བདོག་པ་རྣམས་ཡོངས་སུ་སྤངས་ཏེ་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་བསྒྲུབ་པར་བྱའོ། །
en: “They should abandon everything and achieve pure morality.

source: བཟོད་པ་ལ་གནས་པར་བྱའོ། །
en: They should be established in patience.

source: བརྩོན་འགྲུས་བསྐྱེད་པར་བྱའོ། །བསམ་གཏན་དང་།
en: They should develop effort.
